004-Hao_jet_500um_onlyTop_kOmega_100bar/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;
        //type            zeroGradient;
    }

    pump
    {
        //type            zeroGradient;
        // type            fixedValue;
        // value           uniform 287;
		type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    wall
    {
        type            zeroGradient;
        // type            fixedValue;
        // value           uniform 287;
    }
	

}

// ************************************************************************* //
