004-Hao_jet_500um_onlyTop_kOmega_100bar/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2.6;

boundaryField
{
    wall
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 2.6;
    }

    inlet
    {
        type            fixedValue;
        value           uniform $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $internalField;
        value           uniform $internalField;
    }
}


// ************************************************************************* //
