004-Hao_jet_500um_onlyTop_kOmega_100bar/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            uniformTotalPressure;
        rho             none;
        psi             thermo:psi;
        gamma           1.4;
        p0              table
        (
            (0 1000)
            (2e-007 2000)
            (4e-007 4000)
            (6e-007 8000)
            (8e-007 16000)
            (10e-007 32000)
            (12e-007 64000)
            (14e-007 128000)
            (16e-007 256000)
            (18e-007 500000)
            (20e-007 1e6)
            (22e-007 2e6)
            (24e-007 4e6)
            (26e-007 1e7)	// 1 bar
            (3e-003 1e7) 	// 1 bar
        );
        value           uniform 1000;
    }
    pump
    {
       	type		waveTransmissive;
		field		p;
		psi			thermo:psi;
		gamma		1.4;
		fieldInf	10;//1e-6;//100;//
		lInf		0.5;
		value		uniform 1;//1e-6;//100;//
    }
}


// ************************************************************************* //
