004-Hao_jet_500um_onlyTop_kOmega_100bar/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# adapt the fields
runApplication setFields

#RUN
#runParallel $(getApplication)
rhoCentralFoam 

#------------------------------------------------------------------------------
#------------------------------------------------------------------------------