004-Hao_jet_500um_onlyTop_kOmega_100bar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    wall
    {
        type            wall;
        physicalType    patch;
        nFaces          5132;
        startFace       94476;
    }
    pump
    {
        type            patch;
        physicalType    patch;
        nFaces          2400;
        startFace       99608;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          692;
        startFace       102008;
    }
)

// ************************************************************************* //
