004-Hao_jet_500um_onlyTop_kOmega_100bar/system/blockMeshDict
FoamFile{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.001;

vertices
(	
	(0 -20 -1) 		// 0
	(100 -20 -1) 	// 1
	(0 -3 -1) 		// 2
	(100 -3 -1) 	// 3
	(-10 -0.1 -1) 	// 4
	(-10 0.1 -1) 	// 5
	(0 3 -1) 		// 6
	(100 3 -1) 		// 7
	(0 20 -1) 		// 8
	(100 20 -1) 	// 9
	(0 -20 1) 		// 10
	(100 -20 1) 	// 11
	(0 -3 1) 		// 12
	(100 -3 1) 		// 13
	(-10 -0.1 1) 	// 14
	(-10 0.1 1) 	// 15
	(0 3 1) 		// 16
	(100 3 1) 		// 17
	(0 20 1) 		// 18
	(100 20 1) 		// 19
	(-15 -1 -1)		// 20
	(-15 1 -1)		// 21
	(-15 -1 1)		// 22
	(-15 1 1)		// 23
	(0 -6 -1)		// 24
	(10 -6 -1)		// 25
	(100 -6 -1)		// 26
	(10 -3 -1)		// 27
	(10 3 -1)		// 28
	(0 6 -1)		// 29
	(10 6 -1)		// 30
	(100 6 -1)		// 31
	(0 -6 1)		// 32
	(10 -6 1)		// 33
	(100 -6 1)		// 34
	(10 -3 1)		// 35
	(10 3 1)		// 36
	(0 6 1)			// 37
	(10 6 1)		// 38
	(100 6 1)		// 39
);
blocks
(
	hex (0 1 26 24 10 11 34 32) (50 22 1) simpleGrading (1 1 1) // bottom of chamber
	hex (24 25 27 2 32 33 35 12) (50 20 1) simpleGrading (1 1 1) // right above bottom of chamber, close to gasjet
	hex (25 26 3 27 33 34 13 35) (45 20 1) simpleGrading (1 1 1) // right above bottom of chamber, far from gasjet
	hex (4 2 6 5 14 12 16 15) (100 40 1) simpleGrading (1 1 1) // nozzle diverging
	hex (20 4 5 21 22 14 15 23) (50 40 1) simpleGrading (1 1 1) // nozzle converging
	hex (2 27 28 6 12 35 36 16) (50 40 1) simpleGrading (1 1 1) // middle of chamber, close to gas jet
	hex (27 3 7 28 35 13 17 36) (45 40 1) simpleGrading (1 1 1) // middle of chamber, far from gas jet
	hex (29 31 9 8 37 39 19 18) (50 22 1) simpleGrading (1 1 1) // top of chamber
	hex (6 28 30 29 16 36 38 37) (50 20 1) simpleGrading (1 1 1) // right below top of chamber, close to gasjet
	hex (28 7 31 30 36 17 39 38) (45 20 1) simpleGrading (1 1 1) // right below top of chamber, far from gasjet
);
// Bend the gasjet
edges
(
	arc 5 6 (-5 2.31882 -1)
	arc 15 16 (-5 2.31882 1)
	arc 4 2 (-5 -2.31882 -1)
	arc 14 12 (-5 -2.31882 1)
);
boundary
(
	inlet
    {
        type patch;
        faces
        (
            (20 22 23 21)
        );
    }
	gasjet
    {
        type wall;
        faces
        (
            (5 15 16 6)
			(4 2 12 14)
			(21 23 15 5)
			(20 4 14 22)
			(6 16 37 29)
			(24 32 12 2)
        );
    }
	outlet
	{
		type patch;
		faces
        (
            (29 37 18 8)
			(8 18 19 9)
			(9 19 39 31)
			(31 39 17 7)
			(7 17 13 3)
			(3 13 34 26)
			(26 34 11 1)
			(0 1 11 10)
			(0 10 32 24)
        );
	}
	upper_refine
	{
		type patch;
		faces
		(
			(29 37 38 30)
			(30 38 39 31)
		);
	}
	lower_refine
	{
		type patch;
		faces
		(
			(24 25 33 32)
			(25 26 34 33)
		);
	}
	upper_coarse
	{
		type patch;
		faces
		(
			(29 31 39 37)
		);
	}
	lower_coarse
	{
		type patch;
		faces
		(
			(24 32 34 26)
		);
	}
);

mergePatchPairs
(
	(upper_refine upper_coarse) // merge patch pair 0
	(lower_refine lower_coarse) // merge patch pair 1
);