004-Hao_jet_500um_onlyTop_kOmega_100bar/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "(rho|rhoU|rhoE)"
    {
        solver          smoothSolver;  //diagonal
        smoother        GaussSeidel;
        tolerance       1e-9;
        relTol          0.001;
    }


    "(U|e)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         2;
        tolerance       1e-9;
        relTol          0.001;
    }

    h
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }

    "(k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-9;
        relTol          0.001;
    }
}

relaxationFactors
{
    equations
    {
        ".*"            0.3;    // More under-relaxation
        U               0.3;
        e               0.3;
    }
}

// ************************************************************************* //
